DiffusiveMixing/H-mixer/27deg/D1e-8/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.0000223606797749979 0.0000447213595499958 0)
	(0.0000223606797749979 -0.0000447213595499958 0)
	(0.0020118033988749886 0.00095 0)
	(0.0018881966011250109 0.001 0)
	(0.0000223606797749979 0.002044721359549996 0)
	(-0.0000223606797749979 0.001955278640450004 0)
	(0.0020118033988749886 0.00105 0)
	(0.0022118033988749886 0.00105 0)
	(0.003988196601125011 0.00095 0)
	(0.003788196601125011 0.00105 0)
	(0.004111803398874989 0.001 0)
	(0.005977639320225003 -0.0000447213595499958 0)
	(0.006022360679774998 0.0000447213595499958 0)
	(0.003988196601125011 0.00105 0)
	(0.006022360679774998 0.001955278640450004 0)
	(0.005977639320225003 0.002044721359549996 0)
	(-0.0000223606797749979 0.0000447213595499958 0.0001)
	(0.0000223606797749979 -0.0000447213595499958 0.0001)
	(0.0020118033988749886 0.00095 0.0001)
	(0.0018881966011250109 0.001 0.0001)
	(0.0000223606797749979 0.002044721359549996 0.0001)
	(-0.0000223606797749979 0.001955278640450004 0.0001)
	(0.0020118033988749886 0.00105 0.0001)
	(0.0022118033988749886 0.00105 0.0001)
	(0.003988196601125011 0.00095 0.0001)
	(0.003788196601125011 0.00105 0.0001)
	(0.004111803398874989 0.001 0.0001)
	(0.005977639320225003 -0.0000447213595499958 0.0001)
	(0.006022360679774998 0.0000447213595499958 0.0001)
	(0.003988196601125011 0.00105 0.0001)
	(0.006022360679774998 0.001955278640450004 0.0001)
	(0.005977639320225003 0.002044721359549996 0.0001)
	(0.0020118033988749886 0.001 0)
	(0.003988196601125011 0.001 0)
	(0.00193292 0.000910557 0)
	(0.00193292 0.00108944 0)
	(0.00406708 0.000910557 0)
	(0.00406708 0.00108944 0)
	(0.0020118033988749886 0.001 0.0001)
	(0.003988196601125011 0.001 0.0001)
	(0.00193292 0.000910557 0.0001)
	(0.00193292 0.00108944 0.0001)
	(0.00406708 0.000910557 0.0001)
	(0.00406708 0.00108944 0.0001)
);

blocks (
	hex (0 1 34 3 16 17 40 19) (80 896 1) simpleGrading (1 1 1)
	hex (4 5 3 35 20 21 19 41) (80 896 1) simpleGrading (1 1 1)
	hex (6 32 33 13 22 38 39 29) (80 800 1) simpleGrading (1 1 1)
	hex (32 2 8 33 38 18 24 39) (80 800 1) simpleGrading (1 1 1)
	hex (10 36 11 12 26 42 27 28) (80 896 1) simpleGrading (1 1 1)
	hex (37 10 14 15 43 26 30 31) (80 896 1) simpleGrading (1 1 1)
	hex (3 32 6 35 19 38 22 41) (40 80 1) simpleGrading (1 1 1)
	hex (3 34 2 32 19 40 18 38) (80 40 1) simpleGrading (1 1 1)
	hex (33 8 36 10 39 24 42 26) (80 40 1) simpleGrading (1 1 1)
	hex (33 10 37 13 39 26 43 29) (40 80 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 34 17 40)
			(3 0 19 16)
			(5 3 21 19)
			(35 4 41 20)
			(2 8 18 24)
			(13 6 29 22)
			(36 11 42 27)
			(12 10 28 26)
			(10 14 26 30)
			(15 37 31 43)
			(34 2 40 18)
			(35 6 41 22)
			(8 36 24 42)
			(13 37 29 43)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 16 17)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 20 21)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(11 12 27 28)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(14 15 30 31)
		);
	}
);
